In [1]:
import pandas as pd
df = pd.read_csv(r"C:\Users\Aashir\Downloads\titanic.csv")

In [3]:
df.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [4]:
new_df = df.drop(['PassengerId', 'Name', 'Parch', 'SibSp','Ticket', 'Cabin', 'Embarked' ], axis='columns')

In [5]:
new_df.head(5)

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [6]:
inputs = new_df.drop('Survived', axis= 'columns')
target = new_df.Survived

In [7]:
dummies = pd.get_dummies(inputs.Sex)

In [8]:
inputs = pd.concat([inputs,dummies], axis='columns')

In [9]:
inputs['Age'] = inputs.Age.fillna(inputs.Age.mean())

In [10]:
inputs.drop('Sex', axis ='columns', inplace=True)
inputs

     Pclass        Age     Fare  female  male
0         3  22.000000   7.2500       0     1
1         1  38.000000  71.2833       1     0
2         3  26.000000   7.9250       1     0
3         1  35.000000  53.1000       1     0
4         3  35.000000   8.0500       0     1
..      ...        ...      ...     ...   ...
886       2  27.000000  13.0000       0     1
887       1  19.000000  30.0000       1     0
888       3  29.699118  23.4500       1     0
889       1  26.000000  30.0000       0     1
890       3  32.000000   7.7500       0     1

[891 rows x 5 columns]

In [11]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [15]:
from sklearn.naive_bayes import GaussianNB
gnb = GaussianNB()
gnb.fit(x_train, y_train)

gnb.score(x_test, y_test)

0.7821229050279329

In [17]:
y_test[:10]

650    0
355    0
425    0
60     0
165    1
282    0
435    1
396    0
560    0
491    0
Name: Survived, dtype: int64

In [20]:
gnb.predict(x_test[:10])

array([0, 0, 0, 0, 0, 0, 1, 1, 0, 0], dtype=int64)

In [22]:
import pandas as pd
df = pd.read_csv(r"C:\Users\Aashir\Downloads\spam.csv")
df.groupby('Category').describe()

         Message                                                            \
           count unique                                                top
Category
ham         4825   4516                             Sorry, I'll call later
spam         747    641  Please call our customer service representativ...


         freq
Category
ham        30
spam        4

In [26]:
df['Category'].apply(lambda x: 1 if x == 'spam' else 0 )

0       0
1       0
2       1
3       0
4       0
       ..
5567    1
5568    0
5569    0
5570    0
5571    0
Name: Category, Length: 5572, dtype: int64

In [27]:
df

     Category                                            Message  Spam
0         ham  Go until jurong point, crazy.. Available only ...     0
1         ham                      Ok lar... Joking wif u oni...     0
2        spam  Free entry in 2 a wkly comp to win FA Cup fina...     1
3         ham  U dun say so early hor... U c already then say...     0
4         ham  Nah I don't think he goes to usf, he lives aro...     0
...       ...                                                ...   ...
5567     spam  This is the 2nd time we have tried 2 contact u...     1
5568      ham               Will ü b going to esplanade fr home?     0
5569      ham  Pity, * was in mood for that. So...any other s...     0
5570      ham  The guy did some bitching but I acted like i'd...     0
5571      ham                         Rofl. Its true to its name     0

[5572 rows x 3 columns]

In [28]:
df.drop('Category', axis= 'columns', inplace=True)
df

                                                Message  Spam
0     Go until jurong point, crazy.. Available only ...     0
1                         Ok lar... Joking wif u oni...     0
2     Free entry in 2 a wkly comp to win FA Cup fina...     1
3     U dun say so early hor... U c already then say...     0
4     Nah I don't think he goes to usf, he lives aro...     0
...                                                 ...   ...
5567  This is the 2nd time we have tried 2 contact u...     1
5568               Will ü b going to esplanade fr home?     0
5569  Pity, * was in mood for that. So...any other s...     0
5570  The guy did some bitching but I acted like i'd...     0
5571                         Rofl. Its true to its name     0

[5572 rows x 2 columns]

In [29]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(df.Message, df.Spam, test_size=0.25)

In [30]:
from sklearn.feature_extraction.text import CountVectorizer
v = CountVectorizer()

In [31]:
x_train_count = v.fit_transform(x_train.values)
x_train_count.toarray()[:3]

array([[0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0]], dtype=int64)

In [32]:
from sklearn.naive_bayes import MultinomialNB
model = MultinomialNB()
model.fit(x_train_count, y_train)

MultinomialNB()

In [36]:
emails = [
    "hey bro let's go and play football",
    "upto 20% discount on parking, exclusive offer just for you"
]
email_count = v.transform(emails)

model.predict(email_count)

array([0, 1], dtype=int64)

In [37]:
x_test_count = v.transform(x_test)
model.score(x_test_count, y_test)

0.9834888729361091

In [42]:
from sklearn.pipeline import Pipeline
clf = Pipeline([
        ('vectorizer', CountVectorizer()), 
               ( 'mb', MultinomialNB())
                ])

In [50]:
clf.fit(x_train, y_train)

Pipeline(steps=[('vectorizer', CountVectorizer()), ('mb', MultinomialNB())])

In [51]:
clf.predict(emails)

array([0, 1], dtype=int64)